---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.UpgradedMassingWarning
source: html/957336d8-f598-32ef-dd26-202740e50bf4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.UpgradedMassingWarning Property

Your document contained a Massing element which has been upgraded to a Mass instance. Please review the documentation on the new enhanced Mass capabilities to understand the implications of this change.

## Syntax (C#)
```csharp
public static FailureDefinitionId UpgradedMassingWarning { get; }
```